### Pandas

- Pandas is a software library for data manipulation and analysis.
- It is a open source library and built on top of numpy.
- Pandas allow us fast data analysis,data cleaning and data preparation.
- It can work with data from wide variety of sources.
- Pandas widely used in statistics,finance,neuroscience,web analytics.



- 2 Types

  a) Series    - 1-dimensional labelled array

  b) DataFrame - 2-dimensional labelled array

#### Installation:

- pip install pandas

#### Pandas - Series

In [1]:
import numpy as np
import pandas as pd

#### create a series from list

In [2]:
l=[1,2,3,4,5]
pd.Series(data=l)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
labels=['a','b','c','d','e']
pd.Series(data=l,index=labels)

a    1
b    2
c    3
d    4
e    5
dtype: int64

#### create a series from numpy array

In [4]:
arr=np.array(l)
arr

array([1, 2, 3, 4, 5])

In [5]:
pd.Series(data=arr)

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [6]:
pd.Series(data=arr,index=labels)

a    1
b    2
c    3
d    4
e    5
dtype: int32

#### create a series from dictionary

In [7]:
d={'a':1,'b':2,'c':3,'d':4}

In [8]:
pd.Series(data=d)

a    1
b    2
c    3
d    4
dtype: int64

##### Diff b/w numpy and pandas
- 1.Pandas series has labells but numpy array don't
- 2.Pandas series can hold a variety of datatypes but numpy array don't

In [13]:
np.array([1,2.5,'hello',[1,2,3],{'a':1},(1,2,3),{1,2,3},True])

C:\Users\Tamilselvan.E\AppData\Local\Temp\ipykernel_10044\966280365.py:1: VisibleDeprecationWarning: Creating an ndarray from ragged nested sequences (which is a list-or-tuple of lists-or-tuples-or ndarrays with different lengths or shapes) is deprecated. If you meant to do this, you must specify 'dtype=object' when creating the ndarray.
  np.array([1,2.5,'hello',[1,2,3],{'a':1},(1,2,3),{1,2,3},True])

array([1, 2.5, 'hello', list([1, 2, 3]), {'a': 1}, (1, 2, 3), {1, 2, 3},
       True], dtype=object)

In [14]:
pd.Series(data=[1,2.5,'hello',[1,2,3],{'a':1},(1,2,3),{1,2,3},True])

0            1
1          2.5
2        hello
3    [1, 2, 3]
4     {'a': 1}
5    (1, 2, 3)
6    {1, 2, 3}
7         True
dtype: object

#### Grab Info from a series

In [15]:
sr1=pd.Series(data=[1,2,3,4],index=['A','B','C','D'])
sr1

A    1
B    2
C    3
D    4
dtype: int64

In [16]:
sr2=pd.Series(data=[1,2,4,5],index=['A','B','E','D'])
sr2

A    1
B    2
E    4
D    5
dtype: int64

In [17]:
sr1+sr2

A    2.0
B    4.0
C    NaN
D    9.0
E    NaN
dtype: float64

In [18]:
type(sr1)

pandas.core.series.Series

In [19]:
type(sr1).__name__

'Series'

##### Pandas - DataFrame

In [20]:
import numpy as np
import pandas as pd

In [21]:
df=pd.DataFrame(data=np.random.randn(5,4),index='a b c d e'.split(),columns='w x y z'.split())
df

          w         x         y         z
a  1.090880 -0.103979  1.150815  0.388748
b  0.558561  0.001229  1.543581  0.026833
c -0.058229  0.479950 -1.044720 -2.255785
d -0.347170  0.945518 -0.563476 -2.660190
e  1.192849  1.464874 -1.105011 -0.007565

In [22]:
df.shape

(5, 4)

In [23]:
df.size

20

#### Selecting rows and columns

In [74]:
df

          w         x         y         z       new
a  1.090880 -0.103979  1.150815  0.388748  0.284769
b  0.558561  0.001229  1.543581  0.026833  0.028062
c -0.058229  0.479950 -1.044720 -2.255785 -1.775835
d -0.347170  0.945518 -0.563476 -2.660190 -1.714672
e  1.192849  1.464874 -1.105011 -0.007565  1.457309

In [75]:
df['w'] # single column - Series

a    1.090880
b    0.558561
c   -0.058229
d   -0.347170
e    1.192849
Name: w, dtype: float64

In [77]:
df[['w']] # single column - DataFrame

          w
a  1.090880
b  0.558561
c -0.058229
d -0.347170
e  1.192849

In [76]:
df[['w','z']] # multiple column we have to enter it in a list.

          w         z
a  1.090880  0.388748
b  0.558561  0.026833
c -0.058229 -2.255785
d -0.347170 -2.660190
e  1.192849 -0.007565

- .loc - Access a value through labels.

- .iloc - Access a value through label index.

#### loc
- df.loc[r,c] #labels

In [78]:
df

          w         x         y         z       new
a  1.090880 -0.103979  1.150815  0.388748  0.284769
b  0.558561  0.001229  1.543581  0.026833  0.028062
c -0.058229  0.479950 -1.044720 -2.255785 -1.775835
d -0.347170  0.945518 -0.563476 -2.660190 -1.714672
e  1.192849  1.464874 -1.105011 -0.007565  1.457309

In [79]:
df.loc['a']

w      1.090880
x     -0.103979
y      1.150815
z      0.388748
new    0.284769
Name: a, dtype: float64

In [80]:
type(df.loc['a'])

pandas.core.series.Series

In [81]:
df.loc[['a']]

         w         x         y         z       new
a  1.09088 -0.103979  1.150815  0.388748  0.284769

In [82]:
type(df.loc[['a']])

pandas.core.frame.DataFrame

In [83]:
df

          w         x         y         z       new
a  1.090880 -0.103979  1.150815  0.388748  0.284769
b  0.558561  0.001229  1.543581  0.026833  0.028062
c -0.058229  0.479950 -1.044720 -2.255785 -1.775835
d -0.347170  0.945518 -0.563476 -2.660190 -1.714672
e  1.192849  1.464874 -1.105011 -0.007565  1.457309

In [84]:
df.loc['a']

w      1.090880
x     -0.103979
y      1.150815
z      0.388748
new    0.284769
Name: a, dtype: float64

In [85]:
df.loc['b','w'] # single row and single column

0.5585610182360047

In [86]:
df.loc[['a','e'],['w','z']] # multiple row and multiple column

          w         z
a  1.090880  0.388748
e  1.192849 -0.007565

In [87]:
df.loc['a':'c','y':]

          y         z       new
a  1.150815  0.388748  0.284769
b  1.543581  0.026833  0.028062
c -1.044720 -2.255785 -1.775835

#### .iloc
- df.iloc[r,c] # index

In [88]:
df

          w         x         y         z       new
a  1.090880 -0.103979  1.150815  0.388748  0.284769
b  0.558561  0.001229  1.543581  0.026833  0.028062
c -0.058229  0.479950 -1.044720 -2.255785 -1.775835
d -0.347170  0.945518 -0.563476 -2.660190 -1.714672
e  1.192849  1.464874 -1.105011 -0.007565  1.457309

In [89]:
df.iloc[1]

w      0.558561
x      0.001229
y      1.543581
z      0.026833
new    0.028062
Name: b, dtype: float64

In [90]:
df.iloc[1,]

w      0.558561
x      0.001229
y      1.543581
z      0.026833
new    0.028062
Name: b, dtype: float64

In [91]:
df.iloc[:,2:]

          y         z       new
a  1.150815  0.388748  0.284769
b  1.543581  0.026833  0.028062
c -1.044720 -2.255785 -1.775835
d -0.563476 -2.660190 -1.714672
e -1.105011 -0.007565  1.457309

In [92]:
df.iloc[1,3]

0.02683337763288943

In [93]:
df.iloc[1:,2:]

          y         z       new
b  1.543581  0.026833  0.028062
c -1.044720 -2.255785 -1.775835
d -0.563476 -2.660190 -1.714672
e -1.105011 -0.007565  1.457309

#### Add a new column

In [94]:
df

          w         x         y         z       new
a  1.090880 -0.103979  1.150815  0.388748  0.284769
b  0.558561  0.001229  1.543581  0.026833  0.028062
c -0.058229  0.479950 -1.044720 -2.255785 -1.775835
d -0.347170  0.945518 -0.563476 -2.660190 -1.714672
e  1.192849  1.464874 -1.105011 -0.007565  1.457309

In [95]:
df['new']=df['x']+df['z']
df

          w         x         y         z       new
a  1.090880 -0.103979  1.150815  0.388748  0.284769
b  0.558561  0.001229  1.543581  0.026833  0.028062
c -0.058229  0.479950 -1.044720 -2.255785 -1.775835
d -0.347170  0.945518 -0.563476 -2.660190 -1.714672
e  1.192849  1.464874 -1.105011 -0.007565  1.457309

#### delete a column

In [96]:
df

          w         x         y         z       new
a  1.090880 -0.103979  1.150815  0.388748  0.284769
b  0.558561  0.001229  1.543581  0.026833  0.028062
c -0.058229  0.479950 -1.044720 -2.255785 -1.775835
d -0.347170  0.945518 -0.563476 -2.660190 -1.714672
e  1.192849  1.464874 -1.105011 -0.007565  1.457309

In [97]:
df.drop(columns='new') # axis=0 (row),    axis=1 (column)

          w         x         y         z
a  1.090880 -0.103979  1.150815  0.388748
b  0.558561  0.001229  1.543581  0.026833
c -0.058229  0.479950 -1.044720 -2.255785
d -0.347170  0.945518 -0.563476 -2.660190
e  1.192849  1.464874 -1.105011 -0.007565

In [98]:
df

          w         x         y         z       new
a  1.090880 -0.103979  1.150815  0.388748  0.284769
b  0.558561  0.001229  1.543581  0.026833  0.028062
c -0.058229  0.479950 -1.044720 -2.255785 -1.775835
d -0.347170  0.945518 -0.563476 -2.660190 -1.714672
e  1.192849  1.464874 -1.105011 -0.007565  1.457309

In [99]:
df.drop(columns='new',axis=1)

          w         x         y         z
a  1.090880 -0.103979  1.150815  0.388748
b  0.558561  0.001229  1.543581  0.026833
c -0.058229  0.479950 -1.044720 -2.255785
d -0.347170  0.945518 -0.563476 -2.660190
e  1.192849  1.464874 -1.105011 -0.007565

In [101]:
df.drop(labels='c',axis=0) # delete a row

          w         x         y         z       new
a  1.090880 -0.103979  1.150815  0.388748  0.284769
b  0.558561  0.001229  1.543581  0.026833  0.028062
d -0.347170  0.945518 -0.563476 -2.660190 -1.714672
e  1.192849  1.464874 -1.105011 -0.007565  1.457309

#### Note:
- By default, inplace=False
- To delete a row/column permanently, enter inplace=True

#### Conditional selection

In [102]:
df

          w         x         y         z       new
a  1.090880 -0.103979  1.150815  0.388748  0.284769
b  0.558561  0.001229  1.543581  0.026833  0.028062
c -0.058229  0.479950 -1.044720 -2.255785 -1.775835
d -0.347170  0.945518 -0.563476 -2.660190 -1.714672
e  1.192849  1.464874 -1.105011 -0.007565  1.457309

In [106]:
# 1.condition applied on whole dataframe
# 2.condition statisfies - true,
#             not statisfies - false    
# 3.True --> value
#   False ---> NaN (Null Value)
df[df>0]

          w         x         y         z       new
a  1.090880       NaN  1.150815  0.388748  0.284769
b  0.558561  0.001229  1.543581  0.026833  0.028062
c       NaN  0.479950       NaN       NaN       NaN
d       NaN  0.945518       NaN       NaN       NaN
e  1.192849  1.464874       NaN       NaN  1.457309

In [112]:
# 1.condition applied on column
# 2.condition statisfies -> True
#             not statisfies -> False
# 3.True -> keep it
#   False -> remove


df[df['w']>0]

          w         x         y         z       new
a  1.090880 -0.103979  1.150815  0.388748  0.284769
b  0.558561  0.001229  1.543581  0.026833  0.028062
e  1.192849  1.464874 -1.105011 -0.007565  1.457309

In [115]:
df[df['y']>1]

          w         x         y         z       new
a  1.090880 -0.103979  1.150815  0.388748  0.284769
b  0.558561  0.001229  1.543581  0.026833  0.028062

In [ ]:
#### use multiple conditions
- single value 'and'
- single value 'or'

- multiple values 
  - or   '|'
  - and  '&'

In [116]:
True and True

True

In [117]:
True and False

False

In [118]:
True or False

True

In [119]:
df

          w         x         y         z       new
a  1.090880 -0.103979  1.150815  0.388748  0.284769
b  0.558561  0.001229  1.543581  0.026833  0.028062
c -0.058229  0.479950 -1.044720 -2.255785 -1.775835
d -0.347170  0.945518 -0.563476 -2.660190 -1.714672
e  1.192849  1.464874 -1.105011 -0.007565  1.457309

In [120]:
df[(df['w']>0) & (df['y']>1)] # and operation

          w         x         y         z       new
a  1.090880 -0.103979  1.150815  0.388748  0.284769
b  0.558561  0.001229  1.543581  0.026833  0.028062

In [124]:
df[(df['w']>0) | (df['y']>1)] # or operation

          w         x         y         z       new
a  1.090880 -0.103979  1.150815  0.388748  0.284769
b  0.558561  0.001229  1.543581  0.026833  0.028062
e  1.192849  1.464874 -1.105011 -0.007565  1.457309

In [127]:
df[(df['w']>0) | (df['y']>1)]['x'] # single column

a   -0.103979
b    0.001229
e    1.464874
Name: x, dtype: float64

In [129]:
df[(df['w']>0) | (df['y']>1)][['x']]# single column

          x
a -0.103979
b  0.001229
e  1.464874

In [131]:
df[(df['w']>0) | (df['y']>1)][['w','new']]

          w       new
a  1.090880  0.284769
b  0.558561  0.028062
e  1.192849  1.457309

#### index

In [132]:
df

          w         x         y         z       new
a  1.090880 -0.103979  1.150815  0.388748  0.284769
b  0.558561  0.001229  1.543581  0.026833  0.028062
c -0.058229  0.479950 -1.044720 -2.255785 -1.775835
d -0.347170  0.945518 -0.563476 -2.660190 -1.714672
e  1.192849  1.464874 -1.105011 -0.007565  1.457309

In [135]:
df.reset_index() # by default,inplace=False. To save the change permanently, enter inplace=True

  index         w         x         y         z       new
0     a  1.090880 -0.103979  1.150815  0.388748  0.284769
1     b  0.558561  0.001229  1.543581  0.026833  0.028062
2     c -0.058229  0.479950 -1.044720 -2.255785 -1.775835
3     d -0.347170  0.945518 -0.563476 -2.660190 -1.714672
4     e  1.192849  1.464874 -1.105011 -0.007565  1.457309

In [134]:
df

          w         x         y         z       new
a  1.090880 -0.103979  1.150815  0.388748  0.284769
b  0.558561  0.001229  1.543581  0.026833  0.028062
c -0.058229  0.479950 -1.044720 -2.255785 -1.775835
d -0.347170  0.945518 -0.563476 -2.660190 -1.714672
e  1.192849  1.464874 -1.105011 -0.007565  1.457309

In [136]:
new_index='R G B Y O'.split()
df['colors']=new_index
df

          w         x         y         z       new colors
a  1.090880 -0.103979  1.150815  0.388748  0.284769      R
b  0.558561  0.001229  1.543581  0.026833  0.028062      G
c -0.058229  0.479950 -1.044720 -2.255785 -1.775835      B
d -0.347170  0.945518 -0.563476 -2.660190 -1.714672      Y
e  1.192849  1.464874 -1.105011 -0.007565  1.457309      O

In [138]:
df.set_index('colors') # by default,inplace=False. To save the change permanently, enter inplace=True

               w         x         y         z       new
colors
R       1.090880 -0.103979  1.150815  0.388748  0.284769
G       0.558561  0.001229  1.543581  0.026833  0.028062
B      -0.058229  0.479950 -1.044720 -2.255785 -1.775835
Y      -0.347170  0.945518 -0.563476 -2.660190 -1.714672
O       1.192849  1.464874 -1.105011 -0.007565  1.457309

In [139]:
df

          w         x         y         z       new colors
a  1.090880 -0.103979  1.150815  0.388748  0.284769      R
b  0.558561  0.001229  1.543581  0.026833  0.028062      G
c -0.058229  0.479950 -1.044720 -2.255785 -1.775835      B
d -0.347170  0.945518 -0.563476 -2.660190 -1.714672      Y
e  1.192849  1.464874 -1.105011 -0.007565  1.457309      O

### missing data

In [141]:
d={'A':[1,2,np.nan],'B':[3,np.nan,np.nan],'C':[4,5,6]}
df=pd.DataFrame(data=d)
df

     A    B  C
0  1.0  3.0  4
1  2.0  NaN  5
2  NaN  NaN  6

#### dropna

In [143]:
df.dropna() # by default axis=0, axis=0(row)   and axis=1(column)

     A    B  C
0  1.0  3.0  4

In [144]:
df.dropna(axis=1)

   C
0  4
1  5
2  6

In [145]:
df.dropna(thresh=2)

     A    B  C
0  1.0  3.0  4
1  2.0  NaN  5

In [146]:
df.dropna(thresh=2,axis=1)

     A  C
0  1.0  4
1  2.0  5
2  NaN  6

#### Note:
- By default,inplace=False
- To save the change permanently, enter inplace=True

### fillna

In [147]:
df

     A    B  C
0  1.0  3.0  4
1  2.0  NaN  5
2  NaN  NaN  6

In [148]:
df.fillna(value='R')

     A    B  C
0  1.0  3.0  4
1  2.0    R  5
2    R    R  6

In [150]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [151]:
df

     A    B  C
0  1.0  3.0  4
1  2.0  NaN  5
2  NaN  NaN  6

In [152]:
#### Note:
# By default,inplace=False
# To save the change permanently, enter inplace=True

df['A'].fillna(value=df['A'].mean(),inplace=True)

In [153]:
df

     A    B  C
0  1.0  3.0  4
1  2.0  NaN  5
2  1.5  NaN  6

### Groupby

In [154]:
team_data={'Company':['Apple','Apple','Google','Google','FB','FB'],
           'Person':['Mark','Tom','John','Sara','Mia','Emma'],
           'Sales':[200,150,350,125,260,180]}

In [156]:
df=pd.DataFrame(data=team_data)
df

  Company Person  Sales
0   Apple   Mark    200
1   Apple    Tom    150
2  Google   John    350
3  Google   Sara    125
4      FB    Mia    260
5      FB   Emma    180

In [157]:
df.groupby(by='Company')

In [159]:
df.groupby(by='Company').mean(numeric_only=True)

         Sales
Company
Apple    175.0
FB       220.0
Google   237.5

In [162]:
df.groupby(by='Company').sum(numeric_only=True)

         Sales
Company
Apple      350
FB         440
Google     475

In [165]:
df.groupby(by='Company').std(numeric_only=True)

              Sales
Company
Apple     35.355339
FB        56.568542
Google   159.099026

In [167]:
df.groupby(by='Company').std(numeric_only=True)['Sales']

Company
Apple      35.355339
FB         56.568542
Google    159.099026
Name: Sales, dtype: float64

In [169]:
df.groupby(by='Company').std(numeric_only=True).loc['Apple',] # Series

Sales    35.355339
Name: Apple, dtype: float64

In [171]:
df.groupby(by='Company').std(numeric_only=True).loc[['Apple'],] # DataFrame

             Sales
Company
Apple    35.355339

In [177]:
df

  Company Person  Sales
0   Apple   Mark    200
1   Apple    Tom    150
2  Google   John    350
3  Google   Sara    125
4      FB    Mia    260
5      FB   Emma    180

In [176]:
df.groupby(by='Company').max().loc[:,['Sales']]

         Sales
Company
Apple      200
FB         260
Google     350

In [181]:
df.groupby(by='Company').min().loc[:,['Sales']]

         Sales
Company
Apple      150
FB         180
Google     125

#### groupby with describe method

In [183]:
df.groupby(by='Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
Apple     2.0  175.0   35.355339  150.0  162.50  175.0  187.50  200.0
FB        2.0  220.0   56.568542  180.0  200.00  220.0  240.00  260.0
Google    2.0  237.5  159.099026  125.0  181.25  237.5  293.75  350.0

In [185]:
df.groupby(by='Company').describe().transpose()

Company           Apple          FB      Google
Sales count    2.000000    2.000000    2.000000
      mean   175.000000  220.000000  237.500000
      std     35.355339   56.568542  159.099026
      min    150.000000  180.000000  125.000000
      25%    162.500000  200.000000  181.250000
      50%    175.000000  220.000000  237.500000
      75%    187.500000  240.000000  293.750000
      max    200.000000  260.000000  350.000000

In [186]:
df.groupby(by='Company').describe().T

Company           Apple          FB      Google
Sales count    2.000000    2.000000    2.000000
      mean   175.000000  220.000000  237.500000
      std     35.355339   56.568542  159.099026
      min    150.000000  180.000000  125.000000
      25%    162.500000  200.000000  181.250000
      50%    175.000000  220.000000  237.500000
      75%    187.500000  240.000000  293.750000
      max    200.000000  260.000000  350.000000

#### merging , joining and concatenation

#### concatenation

In [187]:
df1=pd.DataFrame({'A':['A0','A1','A2','A3'],
                  'B':['B0','B1','B2','B3'],
                  'C':['C0','C1','C2','C3'],
                  'D': ['D0','D1','D2','D3']},
                   index = [0, 1, 2, 3])
 
df2=pd.DataFrame({'A':['A4','A5','A6','A7'],
                  'B':['B4','B5','B6','B7'],
                  'C':['C4','C5','C6','C7'],
                  'D':['D4','D5','D6','D7']},
                   index = [4, 5, 6, 7])
 
df3=pd.DataFrame({'A':['A8','A9','A10','A11'],
                  'B':['B8','B9','B10','B11'],
                  'C':['C8','C9','C10','C11'],
                  'D':['D8','D9','D10','D11']},
                   index = [8, 9, 10, 11])

In [188]:
pd.concat([df1,df2,df3]) # axis=0(row),  axis=1(column)

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [189]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

#### merge

In [190]:
df4=pd.DataFrame({'Key':['K0','K1','K2','K3'],
                   'A':['A0','A1','A2','A3'],
                   'B':['B0','B1','B2','B3']})
 
df5=pd.DataFrame({'Key':['K0','K1','K2','K3'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']})

In [191]:
pd.merge(left=df4,right=df5,how='inner',on='Key')

  Key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

#### Join

In [192]:
df6=pd.DataFrame({'A':['A0','A1','A2','A3'],
                  'B':['B0','B1','B2','B3']},
                    index=['K0','K1','K2','K3'])
 
df7=pd.DataFrame({'C':['C0','C1','C2','C3'],
                  'D':['D0','D1','D2','D3']},
                    index=['K0','K1','K2','K4'])

In [193]:
df6.join(df7,how='inner')

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C1  D1
K2  A2  B2  C2  D2

In [194]:
df6.join(df7,how='left')

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1   C1   D1
K2  A2  B2   C2   D2
K3  A3  B3  NaN  NaN

In [195]:
df6.join(df7,how='right')

      A    B   C   D
K0   A0   B0  C0  D0
K1   A1   B1  C1  D1
K2   A2   B2  C2  D2
K4  NaN  NaN  C3  D3

In [196]:
df6.join(df7,how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1   C1   D1
K2   A2   B2   C2   D2
K3   A3   B3  NaN  NaN
K4  NaN  NaN   C3   D3

#### Pandas - operations

In [197]:
df=pd.DataFrame({'col1':[1,2,3,4],
                 'col2':[45,55,65,45],
                 'col3':['asd','jkl','qwe','xyz']})

In [199]:
df['col2'].unique()

array([45, 55, 65], dtype=int64)

In [200]:
df['col2'].nunique()

3

In [201]:
df['col2'].value_counts()

45    2
55    1
65    1
Name: col2, dtype: int64

In [203]:
df.sort_values(by='col2') # by default acsending=True

   col1  col2 col3
0     1    45  asd
3     4    45  xyz
1     2    55  jkl
2     3    65  qwe

In [204]:
df.sort_values(by='col2',ascending=False)

   col1  col2 col3
2     3    65  qwe
1     2    55  jkl
0     1    45  asd
3     4    45  xyz

In [206]:
df.columns.to_list()

['col1', 'col2', 'col3']

In [208]:
df.index.to_list()

[0, 1, 2, 3]

### Apply method

In [209]:
df

   col1  col2 col3
0     1    45  asd
1     2    55  jkl
2     3    65  qwe
3     4    45  xyz

In [210]:
def mul2(x):
    return x*2

In [211]:
df['col1'].sum()

10

In [212]:
df['col1'].apply(mul2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [214]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

#### isnull()

In [220]:
df.isnull() # Null -> True,    Not Null -> False  , (True=1, False=0)

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [221]:
df.isnull().any()

col1    False
col2    False
col3    False
dtype: bool

In [222]:
df.isnull().sum()

col1    0
col2    0
col3    0
dtype: int64

#### isna()

In [224]:
df.isna() # Null -> True, Not Null -> False,  (True=1,False=0)

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [225]:
df.isna().any()

col1    False
col2    False
col3    False
dtype: bool

In [226]:
df.isna().sum()

col1    0
col2    0
col3    0
dtype: int64

#### pivot_table

In [228]:
d={'A':['Red','Red','Red','Green','Green','Green'],
   'B':['One','One','two','two','one','one'],
   'C':['x','y','x','y','x','y'],
   'D':[1,3,5,2,4,1]}
d

{'A': ['Red', 'Red', 'Red', 'Green', 'Green', 'Green'],
 'B': ['One', 'One', 'two', 'two', 'one', 'one'],
 'C': ['x', 'y', 'x', 'y', 'x', 'y'],
 'D': [1, 3, 5, 2, 4, 1]}

In [229]:
df=pd.DataFrame(data=d)
df

       A    B  C  D
0    Red  One  x  1
1    Red  One  y  3
2    Red  two  x  5
3  Green  two  y  2
4  Green  one  x  4
5  Green  one  y  1

In [230]:
df.pivot_table(values='D',index='A,B'.split(sep=','),columns='C')

C            x    y
A     B
Green one  4.0  1.0
      two  NaN  2.0
Red   One  1.0  3.0
      two  5.0  NaN

In [232]:
pd.pivot_table(data=df,values='D',index=['A','B'],columns='C')

C            x    y
A     B
Green one  4.0  1.0
      two  NaN  2.0
Red   One  1.0  3.0
      two  5.0  NaN

##### Reading and writing CSV Files

In [240]:
df

       A    B  C  D
0    Red  One  x  1
1    Red  One  y  3
2    Red  two  x  5
3  Green  two  y  2
4  Green  one  x  4
5  Green  one  y  1

In [241]:
df.to_csv('test1.csv')

In [242]:
pd.read_csv('test1.csv')

   Unnamed: 0      A    B  C  D
0           0    Red  One  x  1
1           1    Red  One  y  3
2           2    Red  two  x  5
3           3  Green  two  y  2
4           4  Green  one  x  4
5           5  Green  one  y  1

In [243]:
pd.read_csv('test1.csv',index_col=0)

       A    B  C  D
0    Red  One  x  1
1    Red  One  y  3
2    Red  two  x  5
3  Green  two  y  2
4  Green  one  x  4
5  Green  one  y  1

In [244]:
df.to_csv('test2.csv',index=False)

In [245]:
pd.read_csv('test2.csv')

       A    B  C  D
0    Red  One  x  1
1    Red  One  y  3
2    Red  two  x  5
3  Green  two  y  2
4  Green  one  x  4
5  Green  one  y  1

#### Reading and writing Excel Files

In [246]:
df

       A    B  C  D
0    Red  One  x  1
1    Red  One  y  3
2    Red  two  x  5
3  Green  two  y  2
4  Green  one  x  4
5  Green  one  y  1

In [247]:
df.to_excel('test3.xlsx',sheet_name='test3_sheet')

In [249]:
pd.read_excel(io='test3.xlsx',sheet_name='test3_sheet')
# single sheet - sheet_name is optional
# multiple sheet - sheet_name is mandatory

   Unnamed: 0      A    B  C  D
0           0    Red  One  x  1
1           1    Red  One  y  3
2           2    Red  two  x  5
3           3  Green  two  y  2
4           4  Green  one  x  4
5           5  Green  one  y  1

In [250]:
pd.read_excel(io='test3.xlsx',sheet_name='test3_sheet',index_col=0)

       A    B  C  D
0    Red  One  x  1
1    Red  One  y  3
2    Red  two  x  5
3  Green  two  y  2
4  Green  one  x  4
5  Green  one  y  1

In [251]:
df.to_excel('test4.xlsx',sheet_name='test4_sheet',index=False)

In [252]:
pd.read_excel(io='test4.xlsx',sheet_name='test4_sheet')

       A    B  C  D
0    Red  One  x  1
1    Red  One  y  3
2    Red  two  x  5
3  Green  two  y  2
4  Green  one  x  4
5  Green  one  y  1